raw = ['绿豆芽', '白酒', '鸭腿', '猪里脊肉', '鳜鱼', '香菇', '红糖', '黄瓜', '面粉', '猪肝', '鸡腿', '胡萝卜', '里脊肉', '柿子椒', '豆腐皮', '甜辣酱', '白芝麻', '蕃茄酱', '蜂蜜', '西红柿', '茭白', '火腿', '肉桂粉', '虾', '豆腐', '番茄', '黄豆芽', '油豆皮', '鱼唇', '茄子', '细香葱', '冬笋', '可乐', '猪大排', '海参', '猪颈肉', '茶树菇', '青椒', '番茄酱', '干贝', '剁椒', '大白菜', '鱼头', '干辣椒', '草鱼', '大葱', '鸡蛋', '地瓜粉', '叉烧酱', '藕', '小白菜', '荸荠', '龙井茶', '小葱', '鸭肉', '母鸡', '鲤鱼', '生菜', '糯米', '豆角', '大蒜', '猪蹄', '鸡腿肉', '西兰花', '猪肉馅', '三黄鸡', '粉条', '生蚝', '香菜', '菠萝', '虾仁', '油豆腐', '豌豆', '红葱头', '尖椒', '糯米粉', '青辣椒', '猪肉', '大肠', '青蒜', '鸡蛋清', '大米', '蒜苔', '鸡', '鸡翅', '花生', '面条', '玉米淀粉', '鸭胗', '春笋', '葱', '鸡肉', '卷心菜', '鲍鱼', '土豆淀粉', '葱白', '粉丝', '红尖椒', '辣椒酱', '咸肉', '墨鱼丸', '沙茶酱', '干香菇', '盐焗粉', '青红椒', '黑木耳', '木耳', '豆豉', '蕃茄', '鱼翅', '红椒', '排骨', '线椒', '米酒', '蛋', '土豆', '鱼膘', '糖桂花', '竹笋', '葱花', '蒜苗', '豆瓣酱', '花椒', '红枣', '五花肉', '腊肠', '猪大肠', '菜花']
def splitMateria(raw_string):
	materias = []
	if raw_string == None:
		return []
	for materia in raw:
		if raw_string.find(materia) != -1:
			materias.append(materia)
	return materias
